installmodules.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>installmodules</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="installmodules"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-31 14:45:39 GMT"/>
<meta name="author" content="Jimmy Tang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="Readme.html"> UP </a>
 |
 <a accesskey="H" href="Readme.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">installmodules</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 For full details read the install and readme file in the source tree</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> For full details read the install and readme file in the source tree</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>ensure build tools are installed (e.g., ubuntu: install build-essential)
</li>
<li>these instructions assume the bash shell
</li>
</ul>


<p>
steps:
</p>
<p>
start with modules-3.2.8.tar.gz (or some version)
untar file
cd modules-3.2.8
</p>
<p>
./configure
make 
sudo make install
(installs to /usr/local/Modules)
</p>
<p>
cd /usr/local/Modules
sudo ln -s 3.2.8 default
</p>
<p>
cd &lt;back to modules-3.2.8&gt;
sudo install -m 644 etc/global/profile.modules /etc/profile.modules
</p>
<p>
/usr/local/Modules/default/bin/add.modules
&lt;and follow instructions&gt;
</p>
<p>
source your .profile (or .bash<sub>profile</sub> etc); this will work for
current terminal
</p>
<p>
you may now have to log out and log in again for this to apply
to  all terminals
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-01-31 14:45:39 GMT</p>
<p class="author">Author: Jimmy Tang</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
